# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [2]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [4]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [5]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [10]:
df["Salary"] = [50000, 60000, 45000]

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [9]:
filtered_df = df[df["Age"] > 18]

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [11]:
from datetime import datetime

df["Birth year"] = datetime.now().year - df["Age"]

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2008
1  Emily   28  Los Angeles   60000        1996
2   Ryan   22      Chicago   45000        2002

### Task 4.2

Add new calculated field `Average age`.

In [12]:
df["Average age"] = df["Age"].mean()

    Name  Age         City  Salary  Birth year  Average age
0   John   16     New York   50000        2008         22.0
1  Emily   28  Los Angeles   60000        1996         22.0
2   Ryan   22      Chicago   45000        2002         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [13]:
df["Absolute Difference"] = abs(df["Age"] - df["Average age"])

,Name,Age,City,Salary,Birth year,Average age,Absolute Difference
0,John,16,New York,50000,2008,22.0,6.0
1,Emily,28,Los Angeles,60000,1996,22.0,6.0
2,Ryan,22,Chicago,45000,2002,22.0,0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [4]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [11]:
merged_df = pd.merge(df1, df2, on="Name")

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [16]:
concatenated_df = pd.concat([df1, df2], axis=0, ignore_index=True)

       0   1      2            3
0   John  25  Emily  Los Angeles
1  Emily  28   Ryan      Chicago
2   Ryan  22   Mike      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [18]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [20]:
add_s = s1 + s2

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [22]:
minus_s = s2 - s1

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [23]:
multiply_s = s1 * s2

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [24]:
division_s = s2 / s1

0    6.000000
1    3.500000
2    2.666667
3    2.250000
4    2.000000
dtype: float64

In [27]:
degree_s = s1 ** s2

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [32]:
division_without_reminder = s2 // s1

0    6
1    3
2    2
3    2
4    2
dtype: int64

In [33]:
division_with_reminder = s2 % s1

0    0
1    1
2    2
3    1
4    0
dtype: int64

In [34]:
even_s1 = s1[s1 % 2 == 0]

1    2
3    4
dtype: int64

In [35]:
odd_s2 = s2[s2 % 2 == 1]

1    7
3    9
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [37]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [38]:
s_uppercase = s.str.upper()

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [39]:
s_len = s_uppercase.str.len()

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [47]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 6.48 s
Wall time: 7.68 s

[62.2, 63.4, 71.2, 70.8, 56.0, 54.8, 53.2, 35.6, 36.2, 47.6]

### Solution using Pandas and Numpy

In [48]:
def optimized_signature():
    data = np.random.randint(1, 101, size=10000000)
    data_series = pd.Series(data)
    moving_averages = data_series.rolling(window=5).mean()
    return moving_averages.dropna().head(10).tolist()

%time optimized_signature()

CPU times: total: 578 ms
Wall time: 718 ms

[36.4, 35.8, 34.2, 30.8, 32.2, 47.4, 44.8, 43.2, 59.2, 52.8]